"use client";
import "./Reviews.scss";
import { useEffect, useState, useContext } from "react";
import { Swiper, SwiperSlide } from "swiper/react";
import { Navigation } from "swiper/modules";
import Link from "next/link";
import Image from "next/image";

import "swiper/css";
import "swiper/css/navigation";

export default function Reviews() {
  const items = [
    {
      id: "1",
      name: "Анна П.",
      rank: 5,
      date: "19 июля 2024",
      text: "Приобрела iluma prime. Быстро помогли подобрать стики по вкусу. Благодарю за великолепную и качественную работу!",
    },
    {
      id: "2",
      name: "Алексей П.",
      rank: 5,
      date: "29 июля 2024",
      text: "Отличный магазин! Очень клиентоориентированные сотрудники. Всегда подробно ответят на вопросы и оперативно организуют доставку товара. Однозначно рекомендую!",
    },
    {
      id: "3",
      name: "Аноним",
      rank: 5,
      date: "24 января 2025",
      text: "Всё дошло в ценности, спасибо вам еще раз! Буду тестить стики с удовольствием)",
    },
    {
      id: "4",
      name: "Аноним",
      rank: 5,
      date: "21 декабря 2024",
      text: "Алена, здравствуйте!) Все получила) спасибо огромное, будем теперь заказывать только у вас🔥🔥🔥",
    },
    {
      id: "5",
      name: "Аноним",
      rank: 5,
      date: "14 декабря 2024",
      text: "Думал в России не найду стики на илюму, но чудо, спасибо вам большое, быстро доставили, вы спасительница👍",
    },
    {
      id: "6",
      name: "Аноним",
      rank: 5,
      date: "5 декабря 2024",
      text: "Спасибо за скорость и оправданное доверие🫶",
    },
    {
      id: "7",
      name: "Аноним",
      rank: 5,
      date: "1 декабря 2024",
      text: "Спасибо большое за оперативность и быструю отправку🤝 Вы меня спасли🫶",
    },
    {
      id: "8",
      name: "Маргарита",
      rank: 5,
      date: "30 октября 2024",
      text: "От всей души благодарю Вас и магазин за доставку, возможность выбора и эксклюзивные, эстетные вещи. Доставили в Петербург за сутки. Качество на высшем уровне, как и всегда.",
    },
    {
      id: "9",
      name: "Аноним",
      rank: 5,
      date: "26 октября 2024",
      text: "Огромное спасибо, все великолепно😍 и подарок👍",
    },
    {
      id: "10",
      name: "М",
      rank: 5,
      date: "18 октября 2024",
      text: "Потрясающее качество и скорость доставки. Сердечно благодарю Вас, Алёна. Прошу разместить в отзывах. С уважением, М",
    },
  ];

  return (
    <div className="reviews">
      <h1>Почему нам доверяют</h1>
      <Swiper
        slidesPerView={"auto"}
        spaceBetween={30}
        navigation={{
          nextEl: ".swiper-button-next-new",
          prevEl: ".swiper-button-prev-new",
        }}
        modules={[Navigation]}
        className="reviews-slider"
        loop="true"
      >
        {items.map((item) => (
          <SwiperSlide key={item.id}>
            <div className="profile">
              <Image
                src={"/Reviews/profile.png"}
                alt="avatar"
                width={80}
                height={80}
              />
              <div className="rank">
                <div className="star">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="1024"
                    height="1024"
                    viewBox="0 0 1024 1024"
                  >
                    <path
                      fill="currentColor"
                      d="m908.1 353.1l-253.9-36.9L540.7 86.1c-3.1-6.3-8.2-11.4-14.5-14.5c-15.8-7.8-35-1.3-42.9 14.5L369.8 316.2l-253.9 36.9c-7 1-13.4 4.3-18.3 9.3a32.05 32.05 0 0 0 .6 45.3l183.7 179.1l-43.4 252.9a31.95 31.95 0 0 0 46.4 33.7L512 754l227.1 119.4c6.2 3.3 13.4 4.4 20.3 3.2c17.4-3 29.1-19.5 26.1-36.9l-43.4-252.9l183.7-179.1c5-4.9 8.3-11.3 9.3-18.3c2.7-17.5-9.5-33.7-27-36.3"
                    />
                  </svg>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="1024"
                    height="1024"
                    viewBox="0 0 1024 1024"
                  >
                    <path
                      fill="currentColor"
                      d="m908.1 353.1l-253.9-36.9L540.7 86.1c-3.1-6.3-8.2-11.4-14.5-14.5c-15.8-7.8-35-1.3-42.9 14.5L369.8 316.2l-253.9 36.9c-7 1-13.4 4.3-18.3 9.3a32.05 32.05 0 0 0 .6 45.3l183.7 179.1l-43.4 252.9a31.95 31.95 0 0 0 46.4 33.7L512 754l227.1 119.4c6.2 3.3 13.4 4.4 20.3 3.2c17.4-3 29.1-19.5 26.1-36.9l-43.4-252.9l183.7-179.1c5-4.9 8.3-11.3 9.3-18.3c2.7-17.5-9.5-33.7-27-36.3"
                    />
                  </svg>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="1024"
                    height="1024"
                    viewBox="0 0 1024 1024"
                  >
                    <path
                      fill="currentColor"
                      d="m908.1 353.1l-253.9-36.9L540.7 86.1c-3.1-6.3-8.2-11.4-14.5-14.5c-15.8-7.8-35-1.3-42.9 14.5L369.8 316.2l-253.9 36.9c-7 1-13.4 4.3-18.3 9.3a32.05 32.05 0 0 0 .6 45.3l183.7 179.1l-43.4 252.9a31.95 31.95 0 0 0 46.4 33.7L512 754l227.1 119.4c6.2 3.3 13.4 4.4 20.3 3.2c17.4-3 29.1-19.5 26.1-36.9l-43.4-252.9l183.7-179.1c5-4.9 8.3-11.3 9.3-18.3c2.7-17.5-9.5-33.7-27-36.3"
                    />
                  </svg>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="1024"
                    height="1024"
                    viewBox="0 0 1024 1024"
                  >
                    <path
                      fill="currentColor"
                      d="m908.1 353.1l-253.9-36.9L540.7 86.1c-3.1-6.3-8.2-11.4-14.5-14.5c-15.8-7.8-35-1.3-42.9 14.5L369.8 316.2l-253.9 36.9c-7 1-13.4 4.3-18.3 9.3a32.05 32.05 0 0 0 .6 45.3l183.7 179.1l-43.4 252.9a31.95 31.95 0 0 0 46.4 33.7L512 754l227.1 119.4c6.2 3.3 13.4 4.4 20.3 3.2c17.4-3 29.1-19.5 26.1-36.9l-43.4-252.9l183.7-179.1c5-4.9 8.3-11.3 9.3-18.3c2.7-17.5-9.5-33.7-27-36.3"
                    />
                  </svg>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="1024"
                    height="1024"
                    viewBox="0 0 1024 1024"
                  >
                    <path
                      fill="currentColor"
                      d="m908.1 353.1l-253.9-36.9L540.7 86.1c-3.1-6.3-8.2-11.4-14.5-14.5c-15.8-7.8-35-1.3-42.9 14.5L369.8 316.2l-253.9 36.9c-7 1-13.4 4.3-18.3 9.3a32.05 32.05 0 0 0 .6 45.3l183.7 179.1l-43.4 252.9a31.95 31.95 0 0 0 46.4 33.7L512 754l227.1 119.4c6.2 3.3 13.4 4.4 20.3 3.2c17.4-3 29.1-19.5 26.1-36.9l-43.4-252.9l183.7-179.1c5-4.9 8.3-11.3 9.3-18.3c2.7-17.5-9.5-33.7-27-36.3"
                    />
                  </svg>
                </div>
                <strong>{item.name}</strong>
                <p>{item.date}</p>
              </div>
            </div>
            <div className="review">{item.text}</div>
          </SwiperSlide>
        ))}
        <button className="swiper-button-prev-new"></button>
        <button className="swiper-button-next-new"></button>
      </Swiper>
    </div>
  );
}
